---
title: ZoneEquipmentData
classe: Autodesk.Revit.DB.Mechanical.ZoneEquipmentData
namespace: Autodesk.Revit.DB.Mechanical
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 12
---

# ZoneEquipmentData

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ElementId AirSystemId { get; set; }` | `zoneEquipmentData.AirSystemId` | ElementId |
| `ElementId ChilledWaterLoopId { get; set; }` | `zoneEquipmentData.ChilledWaterLoopId` | ElementId |
| `ElementId CondenserWaterLoopId { get; set; }` | `zoneEquipmentData.CondenserWaterLoopId` | ElementId |
| `AirCoolingCoilType CoolingCoilType { get; set; }` | `zoneEquipmentData.CoolingCoilType` | AirCoolingCoilType |
| `ZoneEquipmentBehavior EquipmentBehavior { get; set; }` | `zoneEquipmentData.EquipmentBehavior` | ZoneEquipmentBehavior |
| `ZoneEquipmentHvacType EquipmentType { get; set; }` | `zoneEquipmentData.EquipmentType` | ZoneEquipmentHvacType |
| `AirHeatingCoilType HeatingCoilType { get; set; }` | `zoneEquipmentData.HeatingCoilType` | AirHeatingCoilType |
| `ElementId HotWaterLoopId { get; set; }` | `zoneEquipmentData.HotWaterLoopId` | ElementId |
| `Boolean IsValidObject { get; }` | `zoneEquipmentData.IsValidObject` | Boolean |
| `ElementId VRFLoopId { get; set; }` | `zoneEquipmentData.VRFLoopId` | ElementId |
| `Void Dispose()` | `zoneEquipmentData.Dispose()` | Void |
| `Boolean IsDataCompleted()` | `zoneEquipmentData.IsDataCompleted()` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```